[
  {
    "id": "1",
    "title": "Junior Product Manager Opening",
    "author": "HR Team",
    "content": "<div class=\"deadline\"><strong>Deadline:</strong> March 31, 2024</div><br><h2 class=\"section-title\">Description</h2><p>We are seeking a passionate and driven Junior Product Manager to join our team. This role is perfect for someone with 1-2 years of experience in the tech industry, particularly those with a background in Computer Science or a related field. The ideal candidate will have advanced proficiency in at least one coding language of their choice and a strong desire to build and enhance innovative products.</p><p>As a Junior Product Manager, you will play a crucial role in bringing ideas to life, collaborating with engineering teams, working closely with business stakeholders, and advancing our product roadmap. This is an exciting opportunity for someone eager to take ownership and contribute to the development of cutting-edge technology.</p><h2 class=\"section-title\">Required Qualifications</h2><ul><li>1-2 years of experience in a tech-related role, preferably in product management or software development.</li><li>Bachelor's degree in Computer Science, Engineering, or a related field.</li><li>Advanced knowledge of at least one programming language (e.g., Python, Java, JavaScript, etc.).</li><li>Strong problem-solving skills and an analytical mindset.</li><li>Ability to effectively communicate technical and business concepts to diverse stakeholders.</li><li>Experience working with cross-functional teams, including engineering, design, and business units.</li><li>A passion for building and improving products that solve real-world problems.</li><li>Candidate must have taken a product from 0 to 1.</li></ul><h2 class=\"section-title\">Preferred Skills</h2><ul><li>Previous experience as an Associate Product Manager (APM) or in a similar role.</li><li>Master's degree in Computer Science, Business, or a related field.</li><li>Experience working in agile development environments.</li><li>Familiarity with product management tools such as JIRA, Trello, or Asana.</li><li>Understanding of user experience (UX) principles and customer research methodologies.</li><li>Ability to drive data-informed decisions and analyze key product metrics.</li></ul><div class=\"footer\"><p>If you're excited about solving complex problems, leading projects, and working with a dynamic team, we'd love to hear from you!</p><p>Published by: HR Team</p></div>",
    "created_at": "2024-03-13T06:20:00.000Z"
  }
] 